In [9]:
%reload_ext sql
%sql postgresql://saeama:123@localhost/dia

# Phase 1


## Structure du ficher csv ##

Les attributs du fichier `csv` sont :

- Passengerid : Permettant d'identifier le passager.
- Survived : 2 variables `0` pour **Mort** et `1` pour **Vivant**.
- Pclass : 3 variables `1` pour la **1ère Classe**  `2` pour la **2nd Classe** et  `3` pour la **3ème Classe**.
- Name : Nom du passager.
- Sex : Sexe du passager.
- Age : Variant de `1` à `100`.
- Sibsp : Nb de frr et soeur/epoux(se) à bord.
- Ticket : Numèro du ticket, par exemple : `A/5 21171`.
- Fare : Prix du ticket.
- Cabin : Num de la Cabine.
- Embarked : Lieu d'embarquation ( `C` `Q` `S` )


# Phase 2
## Tables ##

On a decidé de diviser le fichier `csv` en 3  **tables**:

1. La table `Clients`: 
    - **IdPassager** : L'identifiant du passager sera la clé primaire de la table.
    - **Nom**
    - **Sexe**
    - **Age**
2. La table `Reservation`:
    - **Ticket**
    - **Cabine**
    - **Pclass**
    - **Embarcation**
    - **Prix**
    - **<font color=red>IdPassager</font>** : clé étrangère provenant de la table `Clients`.
    - **Ticket** et **IdPassager** : Clé primaire.

3. La table `InfoSup`:
    - **IdPassager** : Clé primaire et étrangère.
    - **Survivant**
    - **SibSp**
    - **Parch**

## Création des Tables et du Script ##

Supression des tables si elles existent déjà.
On suprime la table Reservation en premier car elle contient la clé étrangère `IdPassager`

In [25]:
%%sql


drop table if exists reservations; 
drop table if exists infosupclients;
drop table if exists clients;


CREATE TABLE clients(
IdPassager int PRIMARY KEY,
nom varchar(100),
sexe varchar(15),
age varchar);

CREATE TABLE reservations(
Ticket varchar(30),
Cabine varchar(100),
Pclass int,
Embarcation char(1),
Prix float,
primary key (Ticket,IdPassager),
IdPassager int,
foreign key (IdPassager) references clients(IdPassager));

CREATE TABLE infosupclients(
IdPassager int,
Survivant int,
SibSp int,
Parch int,
primary key (IdPassager),
foreign key (IdPassager) references clients(IdPassager));

copy clients from clients.txt
copy reservations from reservations.txt
copy infosupclients from infosupclients.txt

 * postgresql://saeama:***@localhost/dia
Done.
Done.
Done.
Done.
Done.
Done.
(psycopg2.errors.SyntaxError) syntax error at or near "clients"
LINE 1: copy clients from clients.txt
                          ^

[SQL: copy clients from clients.txt
copy reservations from reservations.txt
copy infosupclients from infosupclients.txt]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Alimentation des Table ##
Pour cela nous avons decidé de crée des fichiers `.txt` et de mettre les infos des tables dans les fichiers.

**Exemple de l'un des fichier :** 
<img src = 'Table.png'/>


Et ensuite utiliser la commande `\copy` dans le script

Exemple : `\copy clients from clients.txt`

# Phase 3

Voici quelques requêtes pour voir si les tables ont bien été implementé :

In [27]:
%%sql

select Nom from Clients where age = '40';

 * postgresql://saeama:***@localhost/dia
13 rows affected.

[('Uruchurtu, Don. Manuel E',),
 ('Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',),
 ('Watt, Mrs. James (Elizabeth "Bessie" Inglis Milne)',),
 ('Bourke, Mr. John',),
 ('Blank, Mr. Henry',),
 ('Harrison, Mr. William',),
 ('Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)',),
 ('Smith, Miss. Marion Elsie',),
 ('Skoog, Mr. Wilhelm',),
 ('Sivic, Mr. Husein',),
 ('Shutes, Miss. Elizabeth W',),
 ('Badt, Mr. Mohamed',),
 ('Brown, Mrs. Thomas William Solomon (Elizabeth Catherine Ford)',)]

**1. nombre de classe differentes :**

In [29]:
%%sql
select count(distinct pclass) from reservations;

 * postgresql://saeama:***@localhost/dia
1 rows affected.

[(3,)]

**2. Nombre de Passager par classe.**

In [30]:
%%sql
select pclass,count(pclass) from reservations group by pclass;

 * postgresql://saeama:***@localhost/dia
3 rows affected.

[(1, 216), (3, 491), (2, 184)]

**3. Homme et Femme par classe**

In [32]:
%%sql
SELECT sexe,pclass,count(pclass) from 
                            reservations as r inner join clients as c on r.idpassager = c.idpassager 
                                            group by pclass,sexe;

 * postgresql://saeama:***@localhost/dia
6 rows affected.

[('female', 1, 94),
 ('male', 1, 122),
 ('male', 2, 108),
 ('female', 2, 76),
 ('female', 3, 144),
 ('male', 3, 347)]

**4. Pourcentage Survivant**

In [33]:
%%sql
select Survivant,count(Survivant) as Nb, (round(((select 1.0/count(Survivant) from infosupclients)*count(survivant)),1)*100) as pourcent from infosupclients group by Survivant;

 * postgresql://saeama:***@localhost/dia
2 rows affected.

[(0, 549, Decimal('60.0')), (1, 342, Decimal('40.0'))]

**5. répartition des passagers survivants et morts par classe**

In [34]:
%%sql

select survivant,pclass,count(pclass) 
from reservations as R 
inner join infosupclients as info on R.idpassager = info.idpassager 
inner join Clients as Cl on info.idpassager = Cl.idpassager group by pclass,info.survivant,sexe order by pclass asc;

 * postgresql://saeama:***@localhost/dia
12 rows affected.

[(0, 1, 77),
 (0, 1, 3),
 (1, 1, 91),
 (1, 1, 45),
 (0, 2, 91),
 (0, 2, 6),
 (1, 2, 17),
 (1, 2, 70),
 (0, 3, 72),
 (1, 3, 47),
 (0, 3, 300),
 (1, 3, 72)]

**6. répartition des passagers survivants et des passagers
décédés selon le sexe**

In [36]:
%%sql
select sexe,survivant,pclass,count(pclass) 
from reservations as R 
inner join infosupclients as info on R.idpassager = info.idpassager 
inner join Clients as Cl on info.idpassager = Cl.idpassager group by pclass,info.survivant,sexe order by pclass asc;

 * postgresql://saeama:***@localhost/dia
12 rows affected.

[('male', 0, 1, 77),
 ('female', 0, 1, 3),
 ('female', 1, 1, 91),
 ('male', 1, 1, 45),
 ('male', 0, 2, 91),
 ('female', 0, 2, 6),
 ('male', 1, 2, 17),
 ('female', 1, 2, 70),
 ('female', 0, 3, 72),
 ('male', 1, 3, 47),
 ('male', 0, 3, 300),
 ('female', 1, 3, 72)]